run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/GoerterMellinkDuct1D_Kitamura/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1.8;

boundaryField
{
	DOWN
	{
		 type            turbulentHeatFluxTemperature;
	     heatSource      flux;
		 q               uniform 30000; // 3 W/cm2 
	     alphaEff        alphaEff;
	     value           uniform 1.8; // place holder
	}

    UP
    {
        //type            zeroGradient;
        //type            inletOutlet;
        //inletValue      uniform 1.8;
        //value           uniform 1.8;
        type            fixedValue;
		value			uniform 1.8;
    }

    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            empty;
    }
}

// ************************************************************************* //
